app/Http/Controllers/Auth/AuthController.php

select * from `users` where `name` = 'toto' limit 1
---
    public function login(Request $request)
    {
        $identifiant = $request->name;
        $password= $request->password;

        $Inputs = Input::all();
        $Rules = [
            'name' => 'required|max:255',
            'password' => 'required|max:255',];
        $Messages = [
            'name.required' => 'Veuillez saisir votre identifiant',
            'password.required' => 'Veuillez saisir votre mot de passe',];
        $validator = Validator::make($Inputs, $Rules, $Messages);

        if ($validator->fails()) {
            return redirect('gestion/login')->withErrors($validator)
                ->withInput(Input::except('password'));

        } else {
            $user = User::where('name', '=', $identifiant)->first();