app/Http/Controllers/AlbumController.php

    public function GestionPhotoGroupe($id)
    {
        //Compte les notif
        $notif = $this->Notif();

        $ListeImage = Album::where("ID_type_image","=", $id)
            ->orderby('chantier_image', 'ordre_image')
            ->get();
---
select * from `album` where `ID_type_image` = '3' order by `chantier_image` desc