app/Http/Controllers/AlbumController.php

select * from `album` where `ID_type_image` = '3' order by `ordre_image` asc
---
    public function GestionPhotoGroupe($id)
    {
        //Compte les notif
        $notif = $this->Notif();

        $ListeImage = Album::where("ID_type_image","=", $id)
            ->orderby('ordre_image')
            ->get();