app/Http/Controllers/AlbumController.php

select * from `type_image`
select count(*) as aggregate from `album` where `ID_type_image` = '3'
---
    public function index()
    {
        $NbPhotos = [];

        //Compte les notif
        $notif = $this->Notif();

        //Types
        $MesType = Type_Image::all();

        //compte les photos
        foreach ($MesType as $cle => $valeur) {
            $NbPhotos[$valeur -> ID_type_image ] = Album::where("ID_type_image","=", $valeur -> ID_type_image)->count();

select * from `type_image` where `type_image`.`ID_type_image` = '3' limit 1
insert into `album` (`lien_image`, `ID_type_image`, `ordre_image`) values ('/img/photos/3/04-39-55_Desert.jpg', '3', '1')
---
    public function store(Request $request, $id)
    {

        $Type = Type_Image::find($id);
        $ordreimage = $this->ChercheDernier($id);
        $path = public_path() . '/img/photos/' . $Type->ID_type_image;
        $pathcourt = '/img/photos/' . $Type->ID_type_image;

        $files = $request->file('filesToUpload');
        if($request->hasFile('filesToUpload'))
        {
            if(!File::exists($path)) {
                File::makeDirectory($path);
            }

            foreach ($files as $file) {
                //Store file
                $fileName = $file->getClientOriginalName();
                $storeName = Carbon::now()->format('h-i-s') . '_' . $fileName;
                $file->move($path, $storeName);

                //Store in Dbb
                $image = new Album();
                $ordreimage++;
                $image->lien_image = $pathcourt . '/' . $storeName;
                $image->ID_type_image = $id;
                $image->ordre_image= $ordreimage;
                $image->save();

select * from `album` where `ID_type_image` = '3' order by `ordre_image` asc
---
    public function GestionPhotoGroupe($id)
    {
        //Compte les notif
        $notif = $this->Notif();

        $ListeImage = Album::where("ID_type_image","=", $id)
            ->orderby('ordre_image')
            ->get();

select max(`ordre_image`) as aggregate from `album` where `ID_type_image` = '3'
---
    public function ChercheDernier($id){ //ID des type
        $image = Album::where("ID_type_image","=", $id)->max('ordre_image');;