app/Http/Controllers/TypeImageController.php

    public function index()
    {
        $NbPhotos = [];

        //Compte les notif
        $notif = $this->Notif();

        //Types
        $MesType = Type_Image::all();

        //compte les photos
        foreach ($MesType as $cle => $valeur) {
            $NbPhotos[$valeur -> ID_type_image ] = Album::where("ID_type_image","=", $valeur -> ID_type_image)->count();
---
select * from `type_image` limit 1
select count(*) as aggregate from `album` where `ID_type_image` = '3'
select count(*) as aggregate from `type_image` where `ID_type_image` = '1'

    public function store(Request $request)
    {
        $pathcourt = '/img/vignette/default.png';
        $Type = new Type_Image;

        $Type-> Nom_type_image = Input::get('name');
        $Type-> vignette_type_image = $pathcourt;
        $Type->save();
---
insert into `type_image` (`Nom_type_image`) values ('sqsd')

    public function delete($id)
    {
        $type = Type_Image::find($id);
        $NbImage = Album::where("ID_type_image","=", $type->ID_type_image)->count();

        if ((!$type == null) and ($NbImage == 0)) {
            if ((File::exists(public_path() . $type->vignette_type_image)) and ($type->vignette_type_image <> '/img/vignette/default.png')){
                File::delete(public_path() . $type->vignette_type_image);
            }
            $type->delete();
---
select count(*) as aggregate from `album` where `ID_type_image` = '7'
delete from `type_image` where `ID_type_image` = '7'